Repository: MarcheloJacome/AppTesis
Catalog: projectTesis/apps/app1/locale/*/LC_MESSAGES/django.po
Languages: es

source: Password reset complete
es: Reestablecimiento de contraseña completo

source: Password Reset Complete
es: Reestablecimiento de contraseña completo

source: Your password has been set. You may go ahead and log in now.
es: Tu contraseña ha sido establecida. Puedes continuar e iniciar sesión ahora.

source: Enter new password
es: Ingresa tu contraseña

source: Please enter yout new password twice so we can verify you typed it correctly.
es: Ingresa tu nueva contraseña dos veces para que podamos verificar que la escribiste correctamente.

source: Password reset sent
es: Restablecimiento de contraseña enviado

source: Password Reset Sent
es: Restablecimiento de contraseña enviado

source: We have emailed you instructions for setting your password, if an account exists with the email you provided. You should receive them shortly.
es: Te hemos enviado instrucciones por correo electrónico para configurar tu contraseña, si existe una cuenta con el correo electrónico proporcionado. Deberías recibirlas en breve.

source: If you don't receive an email, please make sure you've entered the address you registered with and check your spam folder.
es: Si no recibes un correo electrónico, asegúrate de haber ingresado la dirección de correo con la que te registraste y revisa tu carpeta de correo no deseado.

source: Create patient
es: Crear paciente

source: Add new Patient
es: Añadir nuevo paciente

source: Details
es: Detalles

source: Add Patient
es: Añadir Paciente

source: Patient details
es: Detalles de paciente

source: Patient Information
es: Información del paciente

source: Back to Patients
es: Volver a Pacientes

source: Check Predictions
es: Revisar predicciones

source: Edit patient
es: Editar paciente

source: Edit Patient
es: Editar paciente

source: Update Patient
es: Actualizar paciente

source: Patients list
es: Lista de pacientes

source: Patients List
es: Lista de pacientes

source: Filter
es: Filtrar

source: Last Prediction
es: Última predicción

source: Probability of HD
es: Probabilidad de enfermedad cardíaca

source: List of predictions
es: Lista de Predicciones

source: Make Prediction
es: Realizar predicción

source: Prediction
es: Predicción

source: Heart Disease Prediction
es: Predicción de enfermedad cardíaca

source: Please enter details
es: Por favor, ingresa los detalles

source: Probability of heart disease
es: Probabilidad de enfermedad cardíaca

source: Create prediction
es: Crear predicción

source: Patient
es: Paciente

source: Back to list
es: Volver a la lista

source: Prediction detail
es: Detalles de predicción

source: Prediction Detail
es: Detalles de predicción

source: Add prediction to model training
es: Añadir predicción a entrenamiento del modelo

source: Edit prediction
es: Editar predicción

source: Edit Prediction
es: Editar predicción

source: Predictions list
es: Lista de predicciones

source: List of Predictions
es: Lista de Predicciones

source: ML Model
es: Modelo de ML

source: Add new Prediction
es: Añadir nueva predicción

source: Confirm prediction to train
es: Confirmar prediccion para entrenar

source: Are you sure youn want to train the model with this prediction?
es: ¿Estás seguro de que deseas entrenar el modelo con esta predicción?

source: This action cannot be undone so make sure all details are correct.
es: Esta acción no se puede deshacer, así que asegúrate que los detalles sean correctos.

source: Train Model
es: Entrenar Modelo

source: Prediction to train detail
es: Detalles de predicción para entrenamiento

source: Prediction to train Detail
es: Detalles de predicción para entrenamiento

source: Train Model with this prediction
es: Entrenar modelo con esta predicción

source: Edit prediction to train
es: Editar predicción para entrenameinto

source: Edit Prediction to Train
es: Editar predicción para entrenameinto

source: Save Prediction
es: Guardar predicción

source: Predictions to train list
es: Lista de predicciones para entrenar

source: List of Predictions to train
es: Lista de predicciones para entrenar

source: Register
es: Registrar

source: Register new account
es: Registrar nueva cuenta

source: Create Account
es: Crear cuenta

source: Already have an account?
es: ¿Ya posees una cuenta?

source: Confirm Password
es: Confirmar contraseña

source: Account was created for
es: Se creó una cuenta para

source: Username or Password is incorrect
es: Usuario o contraseña incorrectos

source: Account was updated for
es: Se actualizó una cuenta para

source: Could not add prediction. It was already used to train the model!
es: No se puedo añadir la predicción. ¡Ya fue usada previamente para entrenar el modelo!
