Repository: MarcheloJacome/AppTesis
Catalog: projectTesis/apps/app1/locale/*/LC_MESSAGES/django.po
Languages: es

source: Name
es: Nombre

source: Id
es: Identificacion

source: Probability > than
es: Probabilidad > a

source: Date
es: Fecha

source: Last name
es: Apellido

source: First Name
es: Nombre

source: Last Name
es: Apellido

source: ID Number
es: Número de identificación

source: City
es: Ciudad

source: Adress
es: Dirección

source: Phone Number
es: Numero telefónico

source: Height (cm)
es: Altura (cm)

source: Weight (kg)
es: Peso (kg)

source: Age
es: Edad

source: Sex
es: Sexo

source: Chest pain type
es: Tipo de dolor de pecho

source: Resting blood pressure
es: Presión arterial en reposo

source: Serum cholesterol
es: Colesterol sérico

source: Fasting blood sugar
es: Azúcar en sangre en ayunas

source: Resting electrocardiogram results
es: Resultados del electrocardiograma en reposo

source: Maximum heart rate achieved
es: Frecuencia cardíaca máxima alcanzada

source: Exercise-induced angina
es: Angina de pecho inducida por ejercicio

source: ECG ST Segment
es: Segmento ST del electrocardiograma

source: ST Slope
es: Pendiente del segmento ST

source: Heart Disease
es: Enfermedad cardíaca

source: Probability of heart disease (%)
es: Probabilidad de enfermedad cardíaca (%)

source: Machine learning model
es: Modelo de machine learning

source: Age of the patient in years
es: Edad del paciente en años

source: Sex of the patient
es: Sexo del paciente

source: Type of chest pain
es: Tipo de dolor de pecho

source: Resting blood pressure measured in: mm/Hg
es: Presión arterial en reposo medida en: mm/Hg

source: Serum cholesterol measured in mm/dl
es: Colesterol sérico medido en mm/dl

source: Fasting blood sugar, wheter it is greater than 120 mg/dl or not
es: Azúcar en sangre en ayunas, si es superior a 120 mg/dl o no

source: Resting electrocardiogram results: Normal: Normal ECG ST: Having ST-T wave abnormality (T wave inversions and or ST elevation or depression of > 0.05 mV) LVH: Showing probable or definite left ventricular hypertrophy by Estes' criteria
es: Resultados del electrocardiograma en reposo: Normal: Electrocardiograma normal ST: Con una anomalía de la onda ST-T (inversiones de la onda T o elevación depresión del ST > 0,05 mV) LVH: Muestra hipertrofia ventricular izquierda probable o definitiva según el criterio de Estes

source: Maximum amount of heart beats achieved per minute under maximum stress
es: Cantidad máxima de latidos cardíacos por minuto bajo estrés máximo

source: Wheter the patient has exercise-induced angina or not
es: Si el paciente tiene angina de pecho inducida por ejercicio o no

source: ST depression. The height difference (in milimiters) between the J point and the baseline (the PR segment)
es: Depresión del segmento ST. La diferencia de altura (en milímetros) entre el punto J y la línea base (el segmento PR)

source: The slope of the peak exercise ST segment: UP: Upslowing FLAT: Flat DOWN: Downslowing
es: La pendiente del segmento ST de ejercicio máximo: ARRIBA: Creciente PLANO: Constante ABAJO: Decreciente

source: Machine learning model to use for prediction
es: Modelo de machine learning a utilizar para la predicción

source: Creation date
es: Fecha de creación

source: Save as new prediction
es: Guardar como nueva predicción

source: Female
es: Femenino

source: Male
es: Masculino

source: Asymptomatic
es: Asintomático

source: Atypical Angina
es: Angina atípica

source: Non-Anginal Pain
es: Dolor no anginoso

source: Typical Angina
es: Angina típica

source: DOWN
es: ABAJO

source: FLAT
es: PLANO

source: UP
es: ARRIBA

source: Blood sugar <= 120 mg/dl
es: Azúcar en sangre <= 120 mg/dl

source: Blood sugar > 120 mg/dl
es: Azúcar en sangre > 120 mg/dl

source: Yes
es: Sí

source: Single Model
es: Modelo Simple

source: Ensemble Models
es: Conjunto de Modelos

source: About ML Models
es: Acerca de modelos de ML

source: Machine Learning Models
es: Modelos de Machine Learning

source: Single Model : XGB Classifier
es: Modelo simple: Clasificador XGB

source: XGBoost stands for 'Extreme Gradient Boosting', where the term 'Gradient Boosting' originates from the paper 'Greedy Function Approximation: A Gradient Boosting Machine', by Friedman.
es: XGBoost significa 'Aumento de gradiente extremo', donde el término 'Aumento de gradiente extremo' se origina del paper 'Greedy Function Approximation: A Gradient Boosting Machine', de Friedman.

source: Gradient boosting is a machine learning technique used in regression and classification tasks, among others. It gives a prediction model in the form of an ensemble of weak prediction models, which are typically decision trees. When a decision tree is the weak learner, the resulting algorithm is called gradient-boosted trees; it usually outperforms random forest. A gradient-boosted trees model is built in a stage-wise fashion as in other boosting methods, but it generalizes the other methods by allowing optimization of an arbitrary differentiable loss function.
es: La potenciación del gradiente es una técnica de aprendizaje automático utilizada en tareas de regresión y clasificación, entre otras. Da un modelo de predicción en la forma de un conjunto de modelos de predicción débiles, que suelen ser arboles de decisión. Cuando un árbol de decisión es el aprendiz débil, el algoritmo resultante es llamado árboles de potenciación del gradiente; por lo general, supera a los bosques aleatorios. Un modelo de árboles de potenciación del gradiente se construye de manera escalonada como en otros métodos de potenciación, pero generaliza los otros métodos al permitir la optimización de una función de pérdida diferenciable arbitraria.

source: Single Model : Multi-Layer Perceptron
es: Modelo simple: Perceptrón Multicapa

source: Multi-layer perceptron could easily be the most useful type of neural network since a perceptron is a single neuron model that worked as a precursor to the larger neural networks.
es: El perceptrón multicapa podría ser fácilmente el tipo de red neuronal mas útil ya que un perceptrón es un modelo de una sola neurona que funcionó como precursor de las redes neuronales más grandes.

source: Neural networks are powerful because they have the ability to learn the representation in the training dataset and relate it to the output variable to be predicted. They are able to learn any mapping function, making them a universal approximation algorithm.
es: Las redes neuronales son poderosas porque tienen la capacidad de aprender la representación en el conjunto de datos de entrenamiento y relacionarla con la variable de salida que se va a predecir. Pueden aprender cualquier función de mapeo, lo que las convierte en un algoritmo de aproximación universal.

source: Multi-layer perceptron consists of three types of layers: the input layer, output layer and hidden layer. The input layer takes the input signal to be processed. The required task, like as prediction and classification, is performed by the output layer. A number of hidden layers, wich is arbitrary, that are placed in between the input and output layer are the computational engine of the MLP. The data flows in the forward direction from input to output layer. The neurons in the MLP are trained with the back propagation learning algorithm. MLPs are designed to approximate any continuous function and can solve problems which are not linearly separable. The major use cases of MLP are pattern classification, recognition, prediction and approximation.
es: El perceptrón multicapa (MLP) consta de tres tipos de capas: la capa de entrada, la capa de salida y la capa oculta. La capa de entrada toma la señal de entrada para procesarla. La tarea requerida, como la predicción y la clasificación, la realiza la capa de salida. Un número de capas ocultas, (número arbitrario) que se colocan entre la capa de entrada y la de salida que son el motor computacional del MLP. Los datos fluyen en dirección directa desde la capa de entrada a la de salida. Las neuronas en el MLP se entrenan con el algoritmo de aprendizaje de propagación hacia atrás. Los MLP están diseñados para aproximar cualquier función continua y pueden resolver problemas que no son linealmente separables. Los principales casos de uso de un MLP son la clasificación, el reconocimiento, la predicción y la aproximación de patrones.

source: Ensemble models : Soft Voting Ensemble Models
es: Conjunto de modelos: Conjunto de modelos de votación suave

source: The goal of ensemble methods is to combine the predictions of several base models built with a given learning algorithm in order to improve generalizability / robustness over a single model.
es: El objetivo del conjunto de models es combinar las predicciones de varios estimadores base construidos con un algoritmo de aprendizaje dado para mejorar la generalizabilidad / robustez sobre un solo estimador.

source: The idea behind the VotingClassifier is to combine conceptually different machine learning classifiers and use a majority vote or the average predicted probabilities (soft vote) to predict the class labels. Such a classifier can be useful for a set of equally well performing model in order to balance out their individual weaknesses.
es: La idea detrás del VotingClassifier es combinar conceptualmente diferentes clasificadores de machine learning y el uso de un voto mayoritario o el promedio de las probabilidades predichas (voto suave) para predecir las etiquetas de la clase. Dicho clasificador puede ser útil para un conjunto de modelos igualmente buenos con el objetivo de equilibrar sus debilidades individuales.

source: The following models were used to build it:
es: Para su construcción se utilizaron los siguientes modelos:

source: XGB Classifier
es: Clasificador XGB

source: K-Nearest Neighbors Classifier
es: Clasificador K-Vecinos Cercanos

source: Stochastic Gradient Boosting Classifier
es: Clasificador de Aumento de Gradiente Estocástico

source: Random Forest Classifier
es: Clasificador de Bosque Aleatorio

source: Multi-Layer Perceptron Classifier
es: Clasificador de Perceptrón Multicapa

source: Choosing the best model
es: Elección del mejor modelo

source: Being able to find the best model for this application is a time consuming, but necessary task, in order to get the best results. In this case, 9 different machine learning models were tested with the default parameters to first have an idea of the path to be followed.
es: Ser capaz de encontrar el mejor modelo para esta aplicación es una demorada, pero necesaria tarea, para obtener los mejores resultados. En este caso, 9 distintos modelos de machine learning fueron probados con sus parámetros predeterminados para primero tener una idea del camino a seguir.

source: Since each model has have numerous amounts of parameters, the number of possible combinations to test are massive, making this task even more time consuming because it’s necessary to be able to find the best hyper-parameters for each model. Thankfully, there is a couple of tools to help with this task: Gridsearch, to find the best hyper-parameters and Cross-Validation to evaluate the obtained hyper-parameters.
es: Dado que cada modelo tiene numerosas cantidades de parámetros, el número de combinaciones posibles para probar son masivas, lo que hace que esta tarea consuma inclusive más tiempo porque es necesario poder encontrar los mejores hiper-parámetros para cada modelo. Afortunadamente, hay un par de herramientas para ayudar con esta tarea: Gridsearch, para encontrar los mejores hiper-parámetros y Cross-Validation para evaluar los hiper-parámetros obtenidos.

source: Whenever a supervised machine learning experiment is done, a common practice is to split the original data into a train set and a test set to avoid “overfitting” the model, which means that it will fail to predict unseen data.
es: Cada vez que se realiza un experimento supervisado de machine learning, una práctica común es dividir los datos originales en un conjunto de entrenamiento y un conjunto de prueba para evitar “sobreajustar” el modelo, lo que significa que fallará en predecir los datos no vistos.

source: Cross-validation is a procedure that splits the data into smaller sets and the model is trained for each set and validated with the remaining part of the data. In the end, the average of the values computed in the loop is reported as the performance measure.
es: Cross-validation es un procedimiento que divide los datos en conjuntos más pequeños y el modelo es entrenado para cada conjunto y se valida con la parte restante de los datos. Al final, el promedio de los valores calculados en el bucle es reportado como la medida de desempeño.

source: This tool generates different candidates for a model or estimator from a grid of parameter values previously specified. It is fitted on a dataset and all the possible combinations of parameter values are evaluated; in the end the best combination is retained.
es: Esta herramienta genera diferentes candidatos para un modelo o estimador a partir de una cuadrícula de valores de parámetros especificados previamente. Es ajustado a un conjunto de datos y todas las posibles combinaciones de valores de parámetros son evaluadas; al finalse conserva la mejor combinación.

source: After applying cross-validation and grid search to each model, the best one (
es: Después de aplicar cross-validation y grid search a cada modelo, el mejor (

source: single model
es: modelo simple

source: ) was chosen, based on its accuracy and ability to be constantly trained with new data. The following 4 models were used to build the
es: ) fue elegido, en base a su precisión y capacidad de ser constantemente entrenado con nuevos datos. Los 4 modelos que le siguieron fueron usados para construir el

source: ensemble models
es: conjunto de modelos

source: Obtained parameters for single model
es: Paámetros obtenidos para el modelo simple

source: A weighed average accuracy of 87 %% was obtained with these parameters.
es: Con estos parámetros se obtuvo una precisión media ponderada del 87%.

source: Obtained parameters for ensemble models
es: Paámetros obtenidos para el conjunto de modelos

source: A weighed average accuracy of 87.51 %% was obtained with these parameters.
es: Con estos parámetros se obtuvo una precisión media ponderada del 87,51%.

source: About Dataset
es: Acerca del conjunto de datos

source: Used Dataset
es: Conjunto de datos usado

source: UCI Heart Disease Dataset
es: Conjunto de datos de enfermedad cardíaca de la UCI

source: This dataset is the result of the combination of 5 already available datasets that contain 76 features including the predicted feature, nevertheless, in this case, only 11 features are used since all published experiments refer to using a subset of the features.
es: Este conjunto de datos es el resultado de la combinación de 5 conjuntos de datos ya disponibles que contienen 76 características, incluida la característica predicha, sin embargo, en este caso, solo se utilizan 11 características ya que todos los experimentos publicados se refieren al uso de un subconjunto de las características.

source: The five datasets used for its curation are:
es: Los cinco conjuntos de datos utilizados para su gestión son:

source: Cleveland: 303 observations
es: Cleveland: 303 observaciones

source: Hungarian: 294 observations
es: Hungaria: 294 observaciones

source: Switzerland: 123 observations
es: Suiza: 123 observaciones

source: Long Beach VA: 200 observations
es: Long Beach: 200 observaciones

source: Stalog (Heart) Data Set: 270 observations
es: Conjunto de datos de Statlog (corazón): 270 observaciones

source: Total: 1190 observations
es: Total: 1190 observaciones

source: Duplicated: 272 observations
es: Duplicado: 272 observaciones

source: Final dataset: 918 observations
es: Conjunto de datos final: 918 observaciones

source: Feature description
es: Descripción de características

source: age of the patient in years.
es: edad del paciente en años

source: sex of the patient (M: Male, F: Female).
es: sexo del paciente (M: Masculino, F: Femenino).

source: chest pain type (TA: Typical Angina, ATA: Atypical Angina, NAP: Non-Anginal Pain, ASY: Asymptomatic).
es: tipo de dolor torácico (TA: Angina típica, ATA: Angina atípica, NAP: dolor no anginoso, ASY: asintomático).

source: resting blood pressure measured in (mm/Hg).
es: presión arterial en reposo medida en: mm/Hg

source: serum cholesterol measured in (mm/Hg).
es: colesterol sérico medido en mm/dl

source: fasting blood sugar (1: if FastingBS > 120 mg/dl, 0: if FastingBS <= 120 mg/dl).
es: azúcar en sangre en ayunas (1: si FastingBS en ayunas > 120 mg/dl, 0: si FastingBS en ayunas <= 120 mg/dl).

source: resting electrocardiogram results (Normal: Normal, ST: having ST-T wave abnormality (T wave inversions and/or ST elevation or depression of > 0.05 mV), LVH: showing probable or definite left ventricular hypertrophy by Estes' criteria).
es: resultados del electrocardiograma en reposo (Normal: Normal, ST: con una anomalíade la onda ST-T (inversiones de la onda T y/o elevación o depresión del ST > 0.05 mV), LVH: muestra hipertrofia ventricular izquierda probable o definitiva según el criterio de Estes).

source: maximum amount of heart beats achieved per minute under maximum stress.
es: cantidad máxima de latidos cardíacos por minuto bajo estrés máximo

source: exercise-induced angina (Y: Yes, N: No).
es: angina de pecho inducida por ejercicio (Y: Si, N: No)

source: ST depression. The height difference (in milimiters) between the J point and the baseline (the PR segment).
es: la diferencia de altura (en milímetros) entre el punto J y la línea base (el segmento PR)

source: the slope of the peak exercise ST segment (Up: upsloping, Flat: flat, Down: downsloping).
es: la pendiente del segmento ST de ejercicio máximo (Up: creciente, Flat: constante, Down: decreciente).

source: output class (1: heart disease, 0: Normal).
es: clase de salida (1: cardiopatía, 0: Normal).

source: As seen above, 5 of the 11 features are not numeric values, they are categorical values, and they need to be transformed into numeric values to be implemented in machine learning models.
es: Como se observa en la parte superior, 5 de las 11 características no son valores numéricos, son valores categóricos, y necesitan ser transformados en valores numéricos para ser implementados en los modelos de machine learning.

source: One way of doing this would be to just assign the numerical value of the entry in the dataset to each categoric feature, but this is not the best approach since machine learning models could assume that higher the categorical value, better the category, which is not always the case. A better approach is using what’s called
es: Una forma de hacer esto sería simplemente asignar el valor numérico de entrada en el conjunto de datos a cada característica categórica, pero este no es el mejor enfoque ya que los modelos de machine learning podrían asumir que mientras más alto el valor categórico, mejor la categoría, que no siempre es así. Un mejor enfoque es usar lo que se llama

source: It is a way to perform a “binarization” of each categoric value and include it as a separate feature to train the model. This means additional columns with only binary values (0 and 1) for each categoric value will be added to the original dataset. 0 indicates non-existent and 1 indicates existent.
es: Es una forma de realizar una “binarización” de cada valor categórico e incluirlos como una característica separada para entrenar el modelo. Esto significa que columnas adicionales con solo valores binarios (0 y 1) para cada valor categórico se agregarán a el conjunto de datos original. 0 indica que no existe y 1 indica que existe.

source: The result of applying “one hot encoding” to the original dataset will look like the following:
es: El resultado de aplicar “one hot encoding” al conjunto de datos original se verá de la siguente manera:

source: Hello, world
es: Hola, mundo

source: Change password
es: Cambiar contraseña

source: Change Password
es: Cambiar contraseña

source: Update Password
es: Actualizar contraseña

source: Edit user
es: Editar usuario

source: Edit User Profile
es: Editar perfil de usuario

source: Want to change your password?
es: ¿Deseas cambiar tu contraseña?

source: Click here
es: Haz clic aquí

source: Update Profile
es: Actualizar perfil

source: About feature importance
es: Acerca de importancia de las características

source: Feature Importance
es: Importancia de las características

source: Feature Importance with XGB Classifier
es: Importancia de las características con el clasificador XGB

source: The XGB Classifier model allows us to get the importance of each feaure used to train the model. Feature importance provides a score that indicates how useful or valuable each feature was in the construction of the boosted decision trees within the model. The more an attribute is used to make key decisions with decision trees, the higher its relative importance.
es: El clasificador XGB nos permite obtener la importancia de cada caracteristica usada para entrenar el modelo. La importancia de las características proporciona una puntuación que indica cuán útil o valiosa cada característica fue en la construcción de los árboles de decisión potenciados dentro de el modelo. Cuanto más se utiliza un atributo para tomar decisiones clave con árboles de decisión, mayor es su importancia relativa.

source: This importance is calculated explicitly for each attribute in the dataset, allowing attributes to be ranked and compared to each other.
es: Esta importancia se calcula explícitamente para cada atributo en el conjunto de datos, permitiendo clasificar los atributos y compararlos entre sí.

source: Importance is calculated for a single decision tree by the amount that each attribute split point improves the performance measure, weighted by the number of observations the node is responsible for. The performance measure may be the purity (Gini index) used to select the split points or another more specific error function.
es: La importancia se calcula para un solo árbol de decisión por la cantidad en la que cada punto de división de atributo mejora la medida de rendimiento, ponderado por la cantidad de observaciones de las que el nodo es responsable. La medida de rendimiento puede ser la pureza (índice de Gini) utilizada para seleccionar los puntos de división u otra función de error más específica.

source: The feature importances are then averaged across all of the the decision trees within the model.
es: Las importancias de las características luego se promedian en todos los árboles de decisión dentro del modelo.

source: Login
es: Iniciar sesión

source: Please login to your account
es: Por favor, ingresa con tu cuenta

source: Username
es: Nombre de usuario

source: Password
es: Contraseña

source: Log in
es: Iniciar sesión

source: Forgot password?
es: ¿Olvidaste tu contraseña?

source: Don't have an account?
es: ¿No posees una cuenta?

source: Create new
es: Crear nueva

source: Home
es: Inicio

source: Patients
es: Pacientes

source: Model Training
es: Entrenamiento de modelo

source: About
es: Acerca de

source: ML Models
es: Modelos de ML

source: Dataset
es: Conjunto de Datos

source: Feature importance
es: Importancia de las características

source: Hello
es: Hola

source: Guest
es: Invitado/a

source: Edit Profile
es: Editar perfil

source: Logout
es: Cerrar sesión

source: Log In
es: Iniciar sesión

source: Password reset
es: Reestablecer contraseña

source: Password Reset
es: Reestablecer contraseña

source: Forgotten your password? Enter your email adress below and we will email instructions to set a new one.
es: ¿Olvidaste tu contraseña? Ingresa tu dirección de correo electrónico y te enviaremos un correo electrónico con instrucciones para restablecerla.

source: Send email
es: Enviar email
